Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/usart.h
/*
 * Component description for USART
 *
 * Copyright (c) 2024 Microchip Technology Inc. and its subsidiaries.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description file (ATDF) version 2023-09-08T03:06:20Z */
#ifndef _PIC32CZCA70_USART_COMPONENT_H_
#define _PIC32CZCA70_USART_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR USART                                        */
/* ************************************************************************** */

/* -------- US_CR : (USART Offset: 0x00) ( /W 32) Control Register -------- */
#define US_CR_Msk                             _UINT32_(0x00000000)                                 /* (US_CR) Register Mask  */

/* USART mode */
#define US_CR_USART_RSTRX_Pos                 _UINT32_(2)                                          /* (US_CR) Reset Receiver Position */
#define US_CR_USART_RSTRX_Msk                 (_UINT32_(0x1) << US_CR_USART_RSTRX_Pos)             /* (US_CR) Reset Receiver Mask */
#define US_CR_USART_RSTRX(value)              (US_CR_USART_RSTRX_Msk & (_UINT32_(value) << US_CR_USART_RSTRX_Pos))
#define US_CR_USART_RSTTX_Pos                 _UINT32_(3)                                          /* (US_CR) Reset Transmitter Position */
#define US_CR_USART_RSTTX_Msk                 (_UINT32_(0x1) << US_CR_USART_RSTTX_Pos)             /* (US_CR) Reset Transmitter Mask */
#define US_CR_USART_RSTTX(value)              (US_CR_USART_RSTTX_Msk & (_UINT32_(value) << US_CR_USART_RSTTX_Pos))
#define US_CR_USART_RXEN_Pos                  _UINT32_(4)                                          /* (US_CR) Receiver Enable Position */
#define US_CR_USART_RXEN_Msk                  (_UINT32_(0x1) << US_CR_USART_RXEN_Pos)              /* (US_CR) Receiver Enable Mask */
#define US_CR_USART_RXEN(value)               (US_CR_USART_RXEN_Msk & (_UINT32_(value) << US_CR_USART_RXEN_Pos))
#define US_CR_USART_RXDIS_Pos                 _UINT32_(5)                                          /* (US_CR) Receiver Disable Position */
#define US_CR_USART_RXDIS_Msk                 (_UINT32_(0x1) << US_CR_USART_RXDIS_Pos)             /* (US_CR) Receiver Disable Mask */
#define US_CR_USART_RXDIS(value)              (US_CR_USART_RXDIS_Msk & (_UINT32_(value) << US_CR_USART_RXDIS_Pos))
#define US_CR_USART_TXEN_Pos                  _UINT32_(6)                                          /* (US_CR) Transmitter Enable Position */
#define US_CR_USART_TXEN_Msk                  (_UINT32_(0x1) << US_CR_USART_TXEN_Pos)              /* (US_CR) Transmitter Enable Mask */
#define US_CR_USART_TXEN(value)               (US_CR_USART_TXEN_Msk & (_UINT32_(value) << US_CR_USART_TXEN_Pos))
#define US_CR_USART_TXDIS_Pos                 _UINT32_(7)                                          /* (US_CR) Transmitter Disable Position */
#define US_CR_USART_TXDIS_Msk                 (_UINT32_(0x1) << US_CR_USART_TXDIS_Pos)             /* (US_CR) Transmitter Disable Mask */
#define US_CR_USART_TXDIS(value)              (US_CR_USART_TXDIS_Msk & (_UINT32_(value) << US_CR_USART_TXDIS_Pos))
#define US_CR_USART_RSTSTA_Pos                _UINT32_(8)                                          /* (US_CR) Reset Status Bits Position */
#define US_CR_USART_RSTSTA_Msk                (_UINT32_(0x1) << US_CR_USART_RSTSTA_Pos)            /* (US_CR) Reset Status Bits Mask */
#define US_CR_USART_RSTSTA(value)             (US_CR_USART_RSTSTA_Msk & (_UINT32_(value) << US_CR_USART_RSTSTA_Pos))
#define US_CR_USART_STTBRK_Pos                _UINT32_(9)                                          /* (US_CR) Start Break Position */
#define US_CR_USART_STTBRK_Msk                (_UINT32_(0x1) << US_CR_USART_STTBRK_Pos)            /* (US_CR) Start Break Mask */
#define US_CR_USART_STTBRK(value)             (US_CR_USART_STTBRK_Msk & (_UINT32_(value) << US_CR_USART_STTBRK_Pos))
#define US_CR_USART_STPBRK_Pos                _UINT32_(10)                                         /* (US_CR) Stop Break Position */
#define US_CR_USART_STPBRK_Msk                (_UINT32_(0x1) << US_CR_USART_STPBRK_Pos)            /* (US_CR) Stop Break Mask */
#define US_CR_USART_STPBRK(value)             (US_CR_USART_STPBRK_Msk & (_UINT32_(value) << US_CR_USART_STPBRK_Pos))
#define US_CR_USART_STTTO_Pos                 _UINT32_(11)                                         /* (US_CR) Clear TIMEOUT Flag and Start Timeout After Next Character Received Position */
#define US_CR_USART_STTTO_Msk                 (_UINT32_(0x1) << US_CR_USART_STTTO_Pos)             /* (US_CR) Clear TIMEOUT Flag and Start Timeout After Next Character Received Mask */
#define US_CR_USART_STTTO(value)              (US_CR_USART_STTTO_Msk & (_UINT32_(value) << US_CR_USART_STTTO_Pos))
#define US_CR_USART_SENDA_Pos                 _UINT32_(12)                                         /* (US_CR) Send Address Position */
#define US_CR_USART_SENDA_Msk                 (_UINT32_(0x1) << US_CR_USART_SENDA_Pos)             /* (US_CR) Send Address Mask */
#define US_CR_USART_SENDA(value)              (US_CR_USART_SENDA_Msk & (_UINT32_(value) << US_CR_USART_SENDA_Pos))
#define US_CR_USART_RSTIT_Pos                 _UINT32_(13)                                         /* (US_CR) Reset Iterations Position */
#define US_CR_USART_RSTIT_Msk                 (_UINT32_(0x1) << US_CR_USART_RSTIT_Pos)             /* (US_CR) Reset Iterations Mask */
#define US_CR_USART_RSTIT(value)              (US_CR_USART_RSTIT_Msk & (_UINT32_(value) << US_CR_USART_RSTIT_Pos))
#define US_CR_USART_RSTNACK_Pos               _UINT32_(14)                                         /* (US_CR) Reset Non Acknowledge Position */
#define US_CR_USART_RSTNACK_Msk               (_UINT32_(0x1) << US_CR_USART_RSTNACK_Pos)           /* (US_CR) Reset Non Acknowledge Mask */
#define US_CR_USART_RSTNACK(value)            (US_CR_USART_RSTNACK_Msk & (_UINT32_(value) << US_CR_USART_RSTNACK_Pos))
#define US_CR_USART_RETTO_Pos                 _UINT32_(15)                                         /* (US_CR) Start Timeout Immediately Position */
#define US_CR_USART_RETTO_Msk                 (_UINT32_(0x1) << US_CR_USART_RETTO_Pos)             /* (US_CR) Start Timeout Immediately Mask */
#define US_CR_USART_RETTO(value)              (US_CR_USART_RETTO_Msk & (_UINT32_(value) << US_CR_USART_RETTO_Pos))
#define US_CR_USART_DTREN_Pos                 _UINT32_(16)                                         /* (US_CR) Data Terminal Ready Enable Position */
#define US_CR_USART_DTREN_Msk                 (_UINT32_(0x1) << US_CR_USART_DTREN_Pos)             /* (US_CR) Data Terminal Ready Enable Mask */
#define US_CR_USART_DTREN(value)              (US_CR_USART_DTREN_Msk & (_UINT32_(value) << US_CR_USART_DTREN_Pos))
#define US_CR_USART_DTRDIS_Pos                _UINT32_(17)                                         /* (US_CR) Data Terminal Ready Disable Position */
#define US_CR_USART_DTRDIS_Msk                (_UINT32_(0x1) << US_CR_USART_DTRDIS_Pos)            /* (US_CR) Data Terminal Ready Disable Mask */
#define US_CR_USART_DTRDIS(value)             (US_CR_USART_DTRDIS_Msk & (_UINT32_(value) << US_CR_USART_DTRDIS_Pos))
#define US_CR_USART_RTSEN_Pos                 _UINT32_(18)                                         /* (US_CR) Request to Send Enable Position */
#define US_CR_USART_RTSEN_Msk                 (_UINT32_(0x1) << US_CR_USART_RTSEN_Pos)             /* (US_CR) Request to Send Enable Mask */
#define US_CR_USART_RTSEN(value)              (US_CR_USART_RTSEN_Msk & (_UINT32_(value) << US_CR_USART_RTSEN_Pos))
#define US_CR_USART_RTSDIS_Pos                _UINT32_(19)                                         /* (US_CR) Request to Send Disable Position */
#define US_CR_USART_RTSDIS_Msk                (_UINT32_(0x1) << US_CR_USART_RTSDIS_Pos)            /* (US_CR) Request to Send Disable Mask */
#define US_CR_USART_RTSDIS(value)             (US_CR_USART_RTSDIS_Msk & (_UINT32_(value) << US_CR_USART_RTSDIS_Pos))
#define US_CR_USART_Msk                       _UINT32_(0x000FFFFC)                                  /* (US_CR_USART) Register Mask  */

/* SPI mode */
#define US_CR_SPI_RSTRX_Pos                   _UINT32_(2)                                          /* (US_CR) Reset Receiver Position */
#define US_CR_SPI_RSTRX_Msk                   (_UINT32_(0x1) << US_CR_SPI_RSTRX_Pos)               /* (US_CR) Reset Receiver Mask */
#define US_CR_SPI_RSTRX(value)                (US_CR_SPI_RSTRX_Msk & (_UINT32_(value) << US_CR_SPI_RSTRX_Pos))
#define US_CR_SPI_RSTTX_Pos                   _UINT32_(3)                                          /* (US_CR) Reset Transmitter Position */
#define US_CR_SPI_RSTTX_Msk                   (_UINT32_(0x1) << US_CR_SPI_RSTTX_Pos)               /* (US_CR) Reset Transmitter Mask */
#define US_CR_SPI_RSTTX(value)                (US_CR_SPI_RSTTX_Msk & (_UINT32_(value) << US_CR_SPI_RSTTX_Pos))
#define US_CR_SPI_RXEN_Pos                    _UINT32_(4)                                          /* (US_CR) Receiver Enable Position */
#define US_CR_SPI_RXEN_Msk                    (_UINT32_(0x1) << US_CR_SPI_RXEN_Pos)                /* (US_CR) Receiver Enable Mask */
#define US_CR_SPI_RXEN(value)                 (US_CR_SPI_RXEN_Msk & (_UINT32_(value) << US_CR_SPI_RXEN_Pos))
#define US_CR_SPI_RXDIS_Pos                   _UINT32_(5)                                          /* (US_CR) Receiver Disable Position */
#define US_CR_SPI_RXDIS_Msk                   (_UINT32_(0x1) << US_CR_SPI_RXDIS_Pos)               /* (US_CR) Receiver Disable Mask */
#define US_CR_SPI_RXDIS(value)                (US_CR_SPI_RXDIS_Msk & (_UINT32_(value) << US_CR_SPI_RXDIS_Pos))
#define US_CR_SPI_TXEN_Pos                    _UINT32_(6)                                          /* (US_CR) Transmitter Enable Position */
#define US_CR_SPI_TXEN_Msk                    (_UINT32_(0x1) << US_CR_SPI_TXEN_Pos)                /* (US_CR) Transmitter Enable Mask */
#define US_CR_SPI_TXEN(value)                 (US_CR_SPI_TXEN_Msk & (_UINT32_(value) << US_CR_SPI_TXEN_Pos))
#define US_CR_SPI_TXDIS_Pos                   _UINT32_(7)                                          /* (US_CR) Transmitter Disable Position */
#define US_CR_SPI_TXDIS_Msk                   (_UINT32_(0x1) << US_CR_SPI_TXDIS_Pos)               /* (US_CR) Transmitter Disable Mask */
#define US_CR_SPI_TXDIS(value)                (US_CR_SPI_TXDIS_Msk & (_UINT32_(value) << US_CR_SPI_TXDIS_Pos))
#define US_CR_SPI_RSTSTA_Pos                  _UINT32_(8)                                          /* (US_CR) Reset Status Bits Position */
#define US_CR_SPI_RSTSTA_Msk                  (_UINT32_(0x1) << US_CR_SPI_RSTSTA_Pos)              /* (US_CR) Reset Status Bits Mask */
#define US_CR_SPI_RSTSTA(value)               (US_CR_SPI_RSTSTA_Msk & (_UINT32_(value) << US_CR_SPI_RSTSTA_Pos))
#define US_CR_SPI_FCS_Pos                     _UINT32_(18)                                         /* (US_CR) Force SPI Chip Select Position */
#define US_CR_SPI_FCS_Msk                     (_UINT32_(0x1) << US_CR_SPI_FCS_Pos)                 /* (US_CR) Force SPI Chip Select Mask */
#define US_CR_SPI_FCS(value)                  (US_CR_SPI_FCS_Msk & (_UINT32_(value) << US_CR_SPI_FCS_Pos))
#define US_CR_SPI_RCS_Pos                     _UINT32_(19)                                         /* (US_CR) Release SPI Chip Select Position */
#define US_CR_SPI_RCS_Msk                     (_UINT32_(0x1) << US_CR_SPI_RCS_Pos)                 /* (US_CR) Release SPI Chip Select Mask */
#define US_CR_SPI_RCS(value)                  (US_CR_SPI_RCS_Msk & (_UINT32_(value) << US_CR_SPI_RCS_Pos))
#define US_CR_SPI_Msk                         _UINT32_(0x000C01FC)                                  /* (US_CR_SPI) Register Mask  */

