Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/usart.h
/* SPI mode */
#define US_MR_SPI_USART_MODE_Pos              _UINT32_(0)                                          /* (US_MR) USART Mode of Operation Position */
#define US_MR_SPI_USART_MODE_Msk              (_UINT32_(0xF) << US_MR_SPI_USART_MODE_Pos)          /* (US_MR) USART Mode of Operation Mask */
#define US_MR_SPI_USART_MODE(value)           (US_MR_SPI_USART_MODE_Msk & (_UINT32_(value) << US_MR_SPI_USART_MODE_Pos))
#define   US_MR_SPI_USART_MODE_NORMAL_Val     _UINT32_(0x0)                                        /* (US_MR) Normal mode  */
#define   US_MR_SPI_USART_MODE_RS485_Val      _UINT32_(0x1)                                        /* (US_MR) RS485  */
#define   US_MR_SPI_USART_MODE_HW_HANDSHAKING_Val _UINT32_(0x2)                                        /* (US_MR) Hardware handshaking  */
#define   US_MR_SPI_USART_MODE_MODEM_Val      _UINT32_(0x3)                                        /* (US_MR) Modem  */
#define   US_MR_SPI_USART_MODE_IS07816_T_0_Val _UINT32_(0x4)                                        /* (US_MR) IS07816 Protocol: T = 0  */
#define   US_MR_SPI_USART_MODE_IS07816_T_1_Val _UINT32_(0x6)                                        /* (US_MR) IS07816 Protocol: T = 1  */
#define   US_MR_SPI_USART_MODE_IRDA_Val       _UINT32_(0x8)                                        /* (US_MR) IrDA  */
#define   US_MR_SPI_USART_MODE_LON_Val        _UINT32_(0x9)                                        /* (US_MR) LON  */
#define   US_MR_SPI_USART_MODE_LIN_MASTER_Val _UINT32_(0xA)                                        /* (US_MR) LIN Master mode  */
#define   US_MR_SPI_USART_MODE_LIN_SLAVE_Val  _UINT32_(0xB)                                        /* (US_MR) LIN Slave mode  */
#define   US_MR_SPI_USART_MODE_SPI_MASTER_Val _UINT32_(0xE)                                        /* (US_MR) SPI Master mode (CLKO must be written to 1 and USCLKS = 0, 1 or 2)  */
#define   US_MR_SPI_USART_MODE_SPI_SLAVE_Val  _UINT32_(0xF)                                        /* (US_MR) SPI Slave mode  */
#define US_MR_SPI_USART_MODE_NORMAL           (US_MR_SPI_USART_MODE_NORMAL_Val << US_MR_SPI_USART_MODE_Pos) /* (US_MR) Normal mode Position  */
#define US_MR_SPI_USART_MODE_RS485            (US_MR_SPI_USART_MODE_RS485_Val << US_MR_SPI_USART_MODE_Pos) /* (US_MR) RS485 Position  */
#define US_MR_SPI_USART_MODE_HW_HANDSHAKING   (US_MR_SPI_USART_MODE_HW_HANDSHAKING_Val << US_MR_SPI_USART_MODE_Pos) /* (US_MR) Hardware handshaking Position  */
#define US_MR_SPI_USART_MODE_MODEM            (US_MR_SPI_USART_MODE_MODEM_Val << US_MR_SPI_USART_MODE_Pos) /* (US_MR) Modem Position  */
#define US_MR_SPI_USART_MODE_IS07816_T_0      (US_MR_SPI_USART_MODE_IS07816_T_0_Val << US_MR_SPI_USART_MODE_Pos) /* (US_MR) IS07816 Protocol: T = 0 Position  */
#define US_MR_SPI_USART_MODE_IS07816_T_1      (US_MR_SPI_USART_MODE_IS07816_T_1_Val << US_MR_SPI_USART_MODE_Pos) /* (US_MR) IS07816 Protocol: T = 1 Position  */
#define US_MR_SPI_USART_MODE_IRDA             (US_MR_SPI_USART_MODE_IRDA_Val << US_MR_SPI_USART_MODE_Pos) /* (US_MR) IrDA Position  */
#define US_MR_SPI_USART_MODE_LON              (US_MR_SPI_USART_MODE_LON_Val << US_MR_SPI_USART_MODE_Pos) /* (US_MR) LON Position  */
#define US_MR_SPI_USART_MODE_LIN_MASTER       (US_MR_SPI_USART_MODE_LIN_MASTER_Val << US_MR_SPI_USART_MODE_Pos) /* (US_MR) LIN Master mode Position  */
#define US_MR_SPI_USART_MODE_LIN_SLAVE        (US_MR_SPI_USART_MODE_LIN_SLAVE_Val << US_MR_SPI_USART_MODE_Pos) /* (US_MR) LIN Slave mode Position  */
#define US_MR_SPI_USART_MODE_SPI_MASTER       (US_MR_SPI_USART_MODE_SPI_MASTER_Val << US_MR_SPI_USART_MODE_Pos) /* (US_MR) SPI Master mode (CLKO must be written to 1 and USCLKS = 0, 1 or 2) Position  */
#define US_MR_SPI_USART_MODE_SPI_SLAVE        (US_MR_SPI_USART_MODE_SPI_SLAVE_Val << US_MR_SPI_USART_MODE_Pos) /* (US_MR) SPI Slave mode Position  */
#define US_MR_SPI_USCLKS_Pos                  _UINT32_(4)                                          /* (US_MR) Clock Selection Position */
#define US_MR_SPI_USCLKS_Msk                  (_UINT32_(0x3) << US_MR_SPI_USCLKS_Pos)              /* (US_MR) Clock Selection Mask */
#define US_MR_SPI_USCLKS(value)               (US_MR_SPI_USCLKS_Msk & (_UINT32_(value) << US_MR_SPI_USCLKS_Pos))
#define   US_MR_SPI_USCLKS_MCK_Val            _UINT32_(0x0)                                        /* (US_MR) Peripheral clock is selected  */
#define   US_MR_SPI_USCLKS_DIV_Val            _UINT32_(0x1)                                        /* (US_MR) Peripheral clock divided (DIV = 8) is selected  */
#define   US_MR_SPI_USCLKS_PCK_Val            _UINT32_(0x2)                                        /* (US_MR) PMC programmable clock (PCK) is selected. If the SCK pin is driven (CLKO = 1), the CD field must be greater than 1.  */
#define   US_MR_SPI_USCLKS_SCK_Val            _UINT32_(0x3)                                        /* (US_MR) Serial clock (SCK) is selected  */
#define US_MR_SPI_USCLKS_MCK                  (US_MR_SPI_USCLKS_MCK_Val << US_MR_SPI_USCLKS_Pos)   /* (US_MR) Peripheral clock is selected Position  */
#define US_MR_SPI_USCLKS_DIV                  (US_MR_SPI_USCLKS_DIV_Val << US_MR_SPI_USCLKS_Pos)   /* (US_MR) Peripheral clock divided (DIV = 8) is selected Position  */
#define US_MR_SPI_USCLKS_PCK                  (US_MR_SPI_USCLKS_PCK_Val << US_MR_SPI_USCLKS_Pos)   /* (US_MR) PMC programmable clock (PCK) is selected. If the SCK pin is driven (CLKO = 1), the CD field must be greater than 1. Position  */
#define US_MR_SPI_USCLKS_SCK                  (US_MR_SPI_USCLKS_SCK_Val << US_MR_SPI_USCLKS_Pos)   /* (US_MR) Serial clock (SCK) is selected Position  */
#define US_MR_SPI_CHRL_Pos                    _UINT32_(6)                                          /* (US_MR) Character Length Position */
#define US_MR_SPI_CHRL_Msk                    (_UINT32_(0x3) << US_MR_SPI_CHRL_Pos)                /* (US_MR) Character Length Mask */
#define US_MR_SPI_CHRL(value)                 (US_MR_SPI_CHRL_Msk & (_UINT32_(value) << US_MR_SPI_CHRL_Pos))
#define   US_MR_SPI_CHRL_5_BIT_Val            _UINT32_(0x0)                                        /* (US_MR) Character length is 5 bits  */
#define   US_MR_SPI_CHRL_6_BIT_Val            _UINT32_(0x1)                                        /* (US_MR) Character length is 6 bits  */
#define   US_MR_SPI_CHRL_7_BIT_Val            _UINT32_(0x2)                                        /* (US_MR) Character length is 7 bits  */
#define   US_MR_SPI_CHRL_8_BIT_Val            _UINT32_(0x3)                                        /* (US_MR) Character length is 8 bits  */
#define US_MR_SPI_CHRL_5_BIT                  (US_MR_SPI_CHRL_5_BIT_Val << US_MR_SPI_CHRL_Pos)     /* (US_MR) Character length is 5 bits Position  */
#define US_MR_SPI_CHRL_6_BIT                  (US_MR_SPI_CHRL_6_BIT_Val << US_MR_SPI_CHRL_Pos)     /* (US_MR) Character length is 6 bits Position  */
#define US_MR_SPI_CHRL_7_BIT                  (US_MR_SPI_CHRL_7_BIT_Val << US_MR_SPI_CHRL_Pos)     /* (US_MR) Character length is 7 bits Position  */
#define US_MR_SPI_CHRL_8_BIT                  (US_MR_SPI_CHRL_8_BIT_Val << US_MR_SPI_CHRL_Pos)     /* (US_MR) Character length is 8 bits Position  */
#define US_MR_SPI_CPHA_Pos                    _UINT32_(8)                                          /* (US_MR) SPI Clock Phase Position */
#define US_MR_SPI_CPHA_Msk                    (_UINT32_(0x1) << US_MR_SPI_CPHA_Pos)                /* (US_MR) SPI Clock Phase Mask */
#define US_MR_SPI_CPHA(value)                 (US_MR_SPI_CPHA_Msk & (_UINT32_(value) << US_MR_SPI_CPHA_Pos))
#define US_MR_SPI_CPOL_Pos                    _UINT32_(16)                                         /* (US_MR) SPI Clock Polarity Position */
#define US_MR_SPI_CPOL_Msk                    (_UINT32_(0x1) << US_MR_SPI_CPOL_Pos)                /* (US_MR) SPI Clock Polarity Mask */
#define US_MR_SPI_CPOL(value)                 (US_MR_SPI_CPOL_Msk & (_UINT32_(value) << US_MR_SPI_CPOL_Pos))
#define US_MR_SPI_CLKO_Pos                    _UINT32_(18)                                         /* (US_MR) Clock Output Select Position */
#define US_MR_SPI_CLKO_Msk                    (_UINT32_(0x1) << US_MR_SPI_CLKO_Pos)                /* (US_MR) Clock Output Select Mask */
#define US_MR_SPI_CLKO(value)                 (US_MR_SPI_CLKO_Msk & (_UINT32_(value) << US_MR_SPI_CLKO_Pos))
#define US_MR_SPI_WRDBT_Pos                   _UINT32_(20)                                         /* (US_MR) Wait Read Data Before Transfer Position */
#define US_MR_SPI_WRDBT_Msk                   (_UINT32_(0x1) << US_MR_SPI_WRDBT_Pos)               /* (US_MR) Wait Read Data Before Transfer Mask */
#define US_MR_SPI_WRDBT(value)                (US_MR_SPI_WRDBT_Msk & (_UINT32_(value) << US_MR_SPI_WRDBT_Pos))
#define US_MR_SPI_Msk                         _UINT32_(0x001501FF)                                  /* (US_MR_SPI) Register Mask  */


