Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/usart.h
/* LIN mode */
#define US_IMR_LIN_RXRDY_Pos                  _UINT32_(0)                                          /* (US_IMR) RXRDY Interrupt Mask Position */
#define US_IMR_LIN_RXRDY_Msk                  (_UINT32_(0x1) << US_IMR_LIN_RXRDY_Pos)              /* (US_IMR) RXRDY Interrupt Mask Mask */
#define US_IMR_LIN_RXRDY(value)               (US_IMR_LIN_RXRDY_Msk & (_UINT32_(value) << US_IMR_LIN_RXRDY_Pos))
#define US_IMR_LIN_TXRDY_Pos                  _UINT32_(1)                                          /* (US_IMR) TXRDY Interrupt Mask Position */
#define US_IMR_LIN_TXRDY_Msk                  (_UINT32_(0x1) << US_IMR_LIN_TXRDY_Pos)              /* (US_IMR) TXRDY Interrupt Mask Mask */
#define US_IMR_LIN_TXRDY(value)               (US_IMR_LIN_TXRDY_Msk & (_UINT32_(value) << US_IMR_LIN_TXRDY_Pos))
#define US_IMR_LIN_OVRE_Pos                   _UINT32_(5)                                          /* (US_IMR) Overrun Error Interrupt Mask Position */
#define US_IMR_LIN_OVRE_Msk                   (_UINT32_(0x1) << US_IMR_LIN_OVRE_Pos)               /* (US_IMR) Overrun Error Interrupt Mask Mask */
#define US_IMR_LIN_OVRE(value)                (US_IMR_LIN_OVRE_Msk & (_UINT32_(value) << US_IMR_LIN_OVRE_Pos))
#define US_IMR_LIN_FRAME_Pos                  _UINT32_(6)                                          /* (US_IMR) Framing Error Interrupt Mask Position */
#define US_IMR_LIN_FRAME_Msk                  (_UINT32_(0x1) << US_IMR_LIN_FRAME_Pos)              /* (US_IMR) Framing Error Interrupt Mask Mask */
#define US_IMR_LIN_FRAME(value)               (US_IMR_LIN_FRAME_Msk & (_UINT32_(value) << US_IMR_LIN_FRAME_Pos))
#define US_IMR_LIN_PARE_Pos                   _UINT32_(7)                                          /* (US_IMR) Parity Error Interrupt Mask Position */
#define US_IMR_LIN_PARE_Msk                   (_UINT32_(0x1) << US_IMR_LIN_PARE_Pos)               /* (US_IMR) Parity Error Interrupt Mask Mask */
#define US_IMR_LIN_PARE(value)                (US_IMR_LIN_PARE_Msk & (_UINT32_(value) << US_IMR_LIN_PARE_Pos))
#define US_IMR_LIN_TIMEOUT_Pos                _UINT32_(8)                                          /* (US_IMR) Timeout Interrupt Mask Position */
#define US_IMR_LIN_TIMEOUT_Msk                (_UINT32_(0x1) << US_IMR_LIN_TIMEOUT_Pos)            /* (US_IMR) Timeout Interrupt Mask Mask */
#define US_IMR_LIN_TIMEOUT(value)             (US_IMR_LIN_TIMEOUT_Msk & (_UINT32_(value) << US_IMR_LIN_TIMEOUT_Pos))
#define US_IMR_LIN_TXEMPTY_Pos                _UINT32_(9)                                          /* (US_IMR) TXEMPTY Interrupt Mask Position */
#define US_IMR_LIN_TXEMPTY_Msk                (_UINT32_(0x1) << US_IMR_LIN_TXEMPTY_Pos)            /* (US_IMR) TXEMPTY Interrupt Mask Mask */
#define US_IMR_LIN_TXEMPTY(value)             (US_IMR_LIN_TXEMPTY_Msk & (_UINT32_(value) << US_IMR_LIN_TXEMPTY_Pos))
#define US_IMR_LIN_LINBK_Pos                  _UINT32_(13)                                         /* (US_IMR) LIN Break Sent or LIN Break Received Interrupt Mask Position */
#define US_IMR_LIN_LINBK_Msk                  (_UINT32_(0x1) << US_IMR_LIN_LINBK_Pos)              /* (US_IMR) LIN Break Sent or LIN Break Received Interrupt Mask Mask */
#define US_IMR_LIN_LINBK(value)               (US_IMR_LIN_LINBK_Msk & (_UINT32_(value) << US_IMR_LIN_LINBK_Pos))
#define US_IMR_LIN_LINID_Pos                  _UINT32_(14)                                         /* (US_IMR) LIN Identifier Sent or LIN Identifier Received Interrupt Mask Position */
#define US_IMR_LIN_LINID_Msk                  (_UINT32_(0x1) << US_IMR_LIN_LINID_Pos)              /* (US_IMR) LIN Identifier Sent or LIN Identifier Received Interrupt Mask Mask */
#define US_IMR_LIN_LINID(value)               (US_IMR_LIN_LINID_Msk & (_UINT32_(value) << US_IMR_LIN_LINID_Pos))
#define US_IMR_LIN_LINTC_Pos                  _UINT32_(15)                                         /* (US_IMR) LIN Transfer Completed Interrupt Mask Position */
#define US_IMR_LIN_LINTC_Msk                  (_UINT32_(0x1) << US_IMR_LIN_LINTC_Pos)              /* (US_IMR) LIN Transfer Completed Interrupt Mask Mask */
#define US_IMR_LIN_LINTC(value)               (US_IMR_LIN_LINTC_Msk & (_UINT32_(value) << US_IMR_LIN_LINTC_Pos))
#define US_IMR_LIN_LINBE_Pos                  _UINT32_(25)                                         /* (US_IMR) LIN Bus Error Interrupt Mask Position */
#define US_IMR_LIN_LINBE_Msk                  (_UINT32_(0x1) << US_IMR_LIN_LINBE_Pos)              /* (US_IMR) LIN Bus Error Interrupt Mask Mask */
#define US_IMR_LIN_LINBE(value)               (US_IMR_LIN_LINBE_Msk & (_UINT32_(value) << US_IMR_LIN_LINBE_Pos))
#define US_IMR_LIN_LINISFE_Pos                _UINT32_(26)                                         /* (US_IMR) LIN Inconsistent Synch Field Error Interrupt Mask Position */
#define US_IMR_LIN_LINISFE_Msk                (_UINT32_(0x1) << US_IMR_LIN_LINISFE_Pos)            /* (US_IMR) LIN Inconsistent Synch Field Error Interrupt Mask Mask */
#define US_IMR_LIN_LINISFE(value)             (US_IMR_LIN_LINISFE_Msk & (_UINT32_(value) << US_IMR_LIN_LINISFE_Pos))
#define US_IMR_LIN_LINIPE_Pos                 _UINT32_(27)                                         /* (US_IMR) LIN Identifier Parity Interrupt Mask Position */
#define US_IMR_LIN_LINIPE_Msk                 (_UINT32_(0x1) << US_IMR_LIN_LINIPE_Pos)             /* (US_IMR) LIN Identifier Parity Interrupt Mask Mask */
#define US_IMR_LIN_LINIPE(value)              (US_IMR_LIN_LINIPE_Msk & (_UINT32_(value) << US_IMR_LIN_LINIPE_Pos))
#define US_IMR_LIN_LINCE_Pos                  _UINT32_(28)                                         /* (US_IMR) LIN Checksum Error Interrupt Mask Position */
#define US_IMR_LIN_LINCE_Msk                  (_UINT32_(0x1) << US_IMR_LIN_LINCE_Pos)              /* (US_IMR) LIN Checksum Error Interrupt Mask Mask */
#define US_IMR_LIN_LINCE(value)               (US_IMR_LIN_LINCE_Msk & (_UINT32_(value) << US_IMR_LIN_LINCE_Pos))
#define US_IMR_LIN_LINSNRE_Pos                _UINT32_(29)                                         /* (US_IMR) LIN Slave Not Responding Error Interrupt Mask Position */
#define US_IMR_LIN_LINSNRE_Msk                (_UINT32_(0x1) << US_IMR_LIN_LINSNRE_Pos)            /* (US_IMR) LIN Slave Not Responding Error Interrupt Mask Mask */
#define US_IMR_LIN_LINSNRE(value)             (US_IMR_LIN_LINSNRE_Msk & (_UINT32_(value) << US_IMR_LIN_LINSNRE_Pos))
#define US_IMR_LIN_LINSTE_Pos                 _UINT32_(30)                                         /* (US_IMR) LIN Synch Tolerance Error Interrupt Mask Position */
#define US_IMR_LIN_LINSTE_Msk                 (_UINT32_(0x1) << US_IMR_LIN_LINSTE_Pos)             /* (US_IMR) LIN Synch Tolerance Error Interrupt Mask Mask */
#define US_IMR_LIN_LINSTE(value)              (US_IMR_LIN_LINSTE_Msk & (_UINT32_(value) << US_IMR_LIN_LINSTE_Pos))
#define US_IMR_LIN_LINHTE_Pos                 _UINT32_(31)                                         /* (US_IMR) LIN Header Timeout Error Interrupt Mask Position */
#define US_IMR_LIN_LINHTE_Msk                 (_UINT32_(0x1) << US_IMR_LIN_LINHTE_Pos)             /* (US_IMR) LIN Header Timeout Error Interrupt Mask Mask */
#define US_IMR_LIN_LINHTE(value)              (US_IMR_LIN_LINHTE_Msk & (_UINT32_(value) << US_IMR_LIN_LINHTE_Pos))
#define US_IMR_LIN_Msk                        _UINT32_(0xFE00E3E3)                                  /* (US_IMR_LIN) Register Mask  */

/* LON mode */
#define US_IMR_LON_RXRDY_Pos                  _UINT32_(0)                                          /* (US_IMR) RXRDY Interrupt Mask Position */
#define US_IMR_LON_RXRDY_Msk                  (_UINT32_(0x1) << US_IMR_LON_RXRDY_Pos)              /* (US_IMR) RXRDY Interrupt Mask Mask */
#define US_IMR_LON_RXRDY(value)               (US_IMR_LON_RXRDY_Msk & (_UINT32_(value) << US_IMR_LON_RXRDY_Pos))
#define US_IMR_LON_TXRDY_Pos                  _UINT32_(1)                                          /* (US_IMR) TXRDY Interrupt Mask Position */
#define US_IMR_LON_TXRDY_Msk                  (_UINT32_(0x1) << US_IMR_LON_TXRDY_Pos)              /* (US_IMR) TXRDY Interrupt Mask Mask */
#define US_IMR_LON_TXRDY(value)               (US_IMR_LON_TXRDY_Msk & (_UINT32_(value) << US_IMR_LON_TXRDY_Pos))
#define US_IMR_LON_OVRE_Pos                   _UINT32_(5)                                          /* (US_IMR) Overrun Error Interrupt Mask Position */
#define US_IMR_LON_OVRE_Msk                   (_UINT32_(0x1) << US_IMR_LON_OVRE_Pos)               /* (US_IMR) Overrun Error Interrupt Mask Mask */
#define US_IMR_LON_OVRE(value)                (US_IMR_LON_OVRE_Msk & (_UINT32_(value) << US_IMR_LON_OVRE_Pos))
#define US_IMR_LON_LSFE_Pos                   _UINT32_(6)                                          /* (US_IMR) LON Short Frame Error Interrupt Mask Position */
#define US_IMR_LON_LSFE_Msk                   (_UINT32_(0x1) << US_IMR_LON_LSFE_Pos)               /* (US_IMR) LON Short Frame Error Interrupt Mask Mask */
#define US_IMR_LON_LSFE(value)                (US_IMR_LON_LSFE_Msk & (_UINT32_(value) << US_IMR_LON_LSFE_Pos))
#define US_IMR_LON_LCRCE_Pos                  _UINT32_(7)                                          /* (US_IMR) LON CRC Error Interrupt Mask Position */
#define US_IMR_LON_LCRCE_Msk                  (_UINT32_(0x1) << US_IMR_LON_LCRCE_Pos)              /* (US_IMR) LON CRC Error Interrupt Mask Mask */
#define US_IMR_LON_LCRCE(value)               (US_IMR_LON_LCRCE_Msk & (_UINT32_(value) << US_IMR_LON_LCRCE_Pos))
#define US_IMR_LON_TXEMPTY_Pos                _UINT32_(9)                                          /* (US_IMR) TXEMPTY Interrupt Mask Position */
#define US_IMR_LON_TXEMPTY_Msk                (_UINT32_(0x1) << US_IMR_LON_TXEMPTY_Pos)            /* (US_IMR) TXEMPTY Interrupt Mask Mask */
#define US_IMR_LON_TXEMPTY(value)             (US_IMR_LON_TXEMPTY_Msk & (_UINT32_(value) << US_IMR_LON_TXEMPTY_Pos))
#define US_IMR_LON_UNRE_Pos                   _UINT32_(10)                                         /* (US_IMR) SPI Underrun Error Interrupt Mask Position */
#define US_IMR_LON_UNRE_Msk                   (_UINT32_(0x1) << US_IMR_LON_UNRE_Pos)               /* (US_IMR) SPI Underrun Error Interrupt Mask Mask */
#define US_IMR_LON_UNRE(value)                (US_IMR_LON_UNRE_Msk & (_UINT32_(value) << US_IMR_LON_UNRE_Pos))
#define US_IMR_LON_LTXD_Pos                   _UINT32_(24)                                         /* (US_IMR) LON Transmission Done Interrupt Mask Position */
#define US_IMR_LON_LTXD_Msk                   (_UINT32_(0x1) << US_IMR_LON_LTXD_Pos)               /* (US_IMR) LON Transmission Done Interrupt Mask Mask */
#define US_IMR_LON_LTXD(value)                (US_IMR_LON_LTXD_Msk & (_UINT32_(value) << US_IMR_LON_LTXD_Pos))
#define US_IMR_LON_LCOL_Pos                   _UINT32_(25)                                         /* (US_IMR) LON Collision Interrupt Mask Position */
#define US_IMR_LON_LCOL_Msk                   (_UINT32_(0x1) << US_IMR_LON_LCOL_Pos)               /* (US_IMR) LON Collision Interrupt Mask Mask */
#define US_IMR_LON_LCOL(value)                (US_IMR_LON_LCOL_Msk & (_UINT32_(value) << US_IMR_LON_LCOL_Pos))
#define US_IMR_LON_LFET_Pos                   _UINT32_(26)                                         /* (US_IMR) LON Frame Early Termination Interrupt Mask Position */
#define US_IMR_LON_LFET_Msk                   (_UINT32_(0x1) << US_IMR_LON_LFET_Pos)               /* (US_IMR) LON Frame Early Termination Interrupt Mask Mask */
#define US_IMR_LON_LFET(value)                (US_IMR_LON_LFET_Msk & (_UINT32_(value) << US_IMR_LON_LFET_Pos))
#define US_IMR_LON_LRXD_Pos                   _UINT32_(27)                                         /* (US_IMR) LON Reception Done Interrupt Mask Position */
#define US_IMR_LON_LRXD_Msk                   (_UINT32_(0x1) << US_IMR_LON_LRXD_Pos)               /* (US_IMR) LON Reception Done Interrupt Mask Mask */
#define US_IMR_LON_LRXD(value)                (US_IMR_LON_LRXD_Msk & (_UINT32_(value) << US_IMR_LON_LRXD_Pos))
#define US_IMR_LON_LBLOVFE_Pos                _UINT32_(28)                                         /* (US_IMR) LON Backlog Overflow Error Interrupt Mask Position */
#define US_IMR_LON_LBLOVFE_Msk                (_UINT32_(0x1) << US_IMR_LON_LBLOVFE_Pos)            /* (US_IMR) LON Backlog Overflow Error Interrupt Mask Mask */
#define US_IMR_LON_LBLOVFE(value)             (US_IMR_LON_LBLOVFE_Msk & (_UINT32_(value) << US_IMR_LON_LBLOVFE_Pos))
#define US_IMR_LON_Msk                        _UINT32_(0x1F0006E3)                                  /* (US_IMR_LON) Register Mask  */


