Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/usart.h
/* LIN mode */
#define US_CSR_LIN_RXRDY_Pos                  _UINT32_(0)                                          /* (US_CSR) Receiver Ready (cleared by reading US_RHR) Position */
#define US_CSR_LIN_RXRDY_Msk                  (_UINT32_(0x1) << US_CSR_LIN_RXRDY_Pos)              /* (US_CSR) Receiver Ready (cleared by reading US_RHR) Mask */
#define US_CSR_LIN_RXRDY(value)               (US_CSR_LIN_RXRDY_Msk & (_UINT32_(value) << US_CSR_LIN_RXRDY_Pos))
#define US_CSR_LIN_TXRDY_Pos                  _UINT32_(1)                                          /* (US_CSR) Transmitter Ready (cleared by writing US_THR) Position */
#define US_CSR_LIN_TXRDY_Msk                  (_UINT32_(0x1) << US_CSR_LIN_TXRDY_Pos)              /* (US_CSR) Transmitter Ready (cleared by writing US_THR) Mask */
#define US_CSR_LIN_TXRDY(value)               (US_CSR_LIN_TXRDY_Msk & (_UINT32_(value) << US_CSR_LIN_TXRDY_Pos))
#define US_CSR_LIN_OVRE_Pos                   _UINT32_(5)                                          /* (US_CSR) Overrun Error (cleared by writing a one to bit US_CR.RSTSTA) Position */
#define US_CSR_LIN_OVRE_Msk                   (_UINT32_(0x1) << US_CSR_LIN_OVRE_Pos)               /* (US_CSR) Overrun Error (cleared by writing a one to bit US_CR.RSTSTA) Mask */
#define US_CSR_LIN_OVRE(value)                (US_CSR_LIN_OVRE_Msk & (_UINT32_(value) << US_CSR_LIN_OVRE_Pos))
#define US_CSR_LIN_FRAME_Pos                  _UINT32_(6)                                          /* (US_CSR) Framing Error (cleared by writing a one to bit US_CR.RSTSTA) Position */
#define US_CSR_LIN_FRAME_Msk                  (_UINT32_(0x1) << US_CSR_LIN_FRAME_Pos)              /* (US_CSR) Framing Error (cleared by writing a one to bit US_CR.RSTSTA) Mask */
#define US_CSR_LIN_FRAME(value)               (US_CSR_LIN_FRAME_Msk & (_UINT32_(value) << US_CSR_LIN_FRAME_Pos))
#define US_CSR_LIN_PARE_Pos                   _UINT32_(7)                                          /* (US_CSR) Parity Error (cleared by writing a one to bit US_CR.RSTSTA) Position */
#define US_CSR_LIN_PARE_Msk                   (_UINT32_(0x1) << US_CSR_LIN_PARE_Pos)               /* (US_CSR) Parity Error (cleared by writing a one to bit US_CR.RSTSTA) Mask */
#define US_CSR_LIN_PARE(value)                (US_CSR_LIN_PARE_Msk & (_UINT32_(value) << US_CSR_LIN_PARE_Pos))
#define US_CSR_LIN_TIMEOUT_Pos                _UINT32_(8)                                          /* (US_CSR) Receiver Timeout (cleared by writing a one to bit US_CR.STTTO) Position */
#define US_CSR_LIN_TIMEOUT_Msk                (_UINT32_(0x1) << US_CSR_LIN_TIMEOUT_Pos)            /* (US_CSR) Receiver Timeout (cleared by writing a one to bit US_CR.STTTO) Mask */
#define US_CSR_LIN_TIMEOUT(value)             (US_CSR_LIN_TIMEOUT_Msk & (_UINT32_(value) << US_CSR_LIN_TIMEOUT_Pos))
#define US_CSR_LIN_TXEMPTY_Pos                _UINT32_(9)                                          /* (US_CSR) Transmitter Empty (cleared by writing US_THR) Position */
#define US_CSR_LIN_TXEMPTY_Msk                (_UINT32_(0x1) << US_CSR_LIN_TXEMPTY_Pos)            /* (US_CSR) Transmitter Empty (cleared by writing US_THR) Mask */
#define US_CSR_LIN_TXEMPTY(value)             (US_CSR_LIN_TXEMPTY_Msk & (_UINT32_(value) << US_CSR_LIN_TXEMPTY_Pos))
#define US_CSR_LIN_LINBK_Pos                  _UINT32_(13)                                         /* (US_CSR) LIN Break Sent or LIN Break Received Position */
#define US_CSR_LIN_LINBK_Msk                  (_UINT32_(0x1) << US_CSR_LIN_LINBK_Pos)              /* (US_CSR) LIN Break Sent or LIN Break Received Mask */
#define US_CSR_LIN_LINBK(value)               (US_CSR_LIN_LINBK_Msk & (_UINT32_(value) << US_CSR_LIN_LINBK_Pos))
#define US_CSR_LIN_LINID_Pos                  _UINT32_(14)                                         /* (US_CSR) LIN Identifier Sent or LIN Identifier Received Position */
#define US_CSR_LIN_LINID_Msk                  (_UINT32_(0x1) << US_CSR_LIN_LINID_Pos)              /* (US_CSR) LIN Identifier Sent or LIN Identifier Received Mask */
#define US_CSR_LIN_LINID(value)               (US_CSR_LIN_LINID_Msk & (_UINT32_(value) << US_CSR_LIN_LINID_Pos))
#define US_CSR_LIN_LINTC_Pos                  _UINT32_(15)                                         /* (US_CSR) LIN Transfer Completed Position */
#define US_CSR_LIN_LINTC_Msk                  (_UINT32_(0x1) << US_CSR_LIN_LINTC_Pos)              /* (US_CSR) LIN Transfer Completed Mask */
#define US_CSR_LIN_LINTC(value)               (US_CSR_LIN_LINTC_Msk & (_UINT32_(value) << US_CSR_LIN_LINTC_Pos))
#define US_CSR_LIN_LINBLS_Pos                 _UINT32_(23)                                         /* (US_CSR) LIN Bus Line Status Position */
#define US_CSR_LIN_LINBLS_Msk                 (_UINT32_(0x1) << US_CSR_LIN_LINBLS_Pos)             /* (US_CSR) LIN Bus Line Status Mask */
#define US_CSR_LIN_LINBLS(value)              (US_CSR_LIN_LINBLS_Msk & (_UINT32_(value) << US_CSR_LIN_LINBLS_Pos))
#define US_CSR_LIN_LINBE_Pos                  _UINT32_(25)                                         /* (US_CSR) LIN Bus Error Position */
#define US_CSR_LIN_LINBE_Msk                  (_UINT32_(0x1) << US_CSR_LIN_LINBE_Pos)              /* (US_CSR) LIN Bus Error Mask */
#define US_CSR_LIN_LINBE(value)               (US_CSR_LIN_LINBE_Msk & (_UINT32_(value) << US_CSR_LIN_LINBE_Pos))
#define US_CSR_LIN_LINISFE_Pos                _UINT32_(26)                                         /* (US_CSR) LIN Inconsistent Synch Field Error Position */
#define US_CSR_LIN_LINISFE_Msk                (_UINT32_(0x1) << US_CSR_LIN_LINISFE_Pos)            /* (US_CSR) LIN Inconsistent Synch Field Error Mask */
#define US_CSR_LIN_LINISFE(value)             (US_CSR_LIN_LINISFE_Msk & (_UINT32_(value) << US_CSR_LIN_LINISFE_Pos))
#define US_CSR_LIN_LINIPE_Pos                 _UINT32_(27)                                         /* (US_CSR) LIN Identifier Parity Error Position */
#define US_CSR_LIN_LINIPE_Msk                 (_UINT32_(0x1) << US_CSR_LIN_LINIPE_Pos)             /* (US_CSR) LIN Identifier Parity Error Mask */
#define US_CSR_LIN_LINIPE(value)              (US_CSR_LIN_LINIPE_Msk & (_UINT32_(value) << US_CSR_LIN_LINIPE_Pos))
#define US_CSR_LIN_LINCE_Pos                  _UINT32_(28)                                         /* (US_CSR) LIN Checksum Error Position */
#define US_CSR_LIN_LINCE_Msk                  (_UINT32_(0x1) << US_CSR_LIN_LINCE_Pos)              /* (US_CSR) LIN Checksum Error Mask */
#define US_CSR_LIN_LINCE(value)               (US_CSR_LIN_LINCE_Msk & (_UINT32_(value) << US_CSR_LIN_LINCE_Pos))
#define US_CSR_LIN_LINSNRE_Pos                _UINT32_(29)                                         /* (US_CSR) LIN Slave Not Responding Error Interrupt Mask Position */
#define US_CSR_LIN_LINSNRE_Msk                (_UINT32_(0x1) << US_CSR_LIN_LINSNRE_Pos)            /* (US_CSR) LIN Slave Not Responding Error Interrupt Mask Mask */
#define US_CSR_LIN_LINSNRE(value)             (US_CSR_LIN_LINSNRE_Msk & (_UINT32_(value) << US_CSR_LIN_LINSNRE_Pos))
#define US_CSR_LIN_LINSTE_Pos                 _UINT32_(30)                                         /* (US_CSR) LIN Synch Tolerance Error Position */
#define US_CSR_LIN_LINSTE_Msk                 (_UINT32_(0x1) << US_CSR_LIN_LINSTE_Pos)             /* (US_CSR) LIN Synch Tolerance Error Mask */
#define US_CSR_LIN_LINSTE(value)              (US_CSR_LIN_LINSTE_Msk & (_UINT32_(value) << US_CSR_LIN_LINSTE_Pos))
#define US_CSR_LIN_LINHTE_Pos                 _UINT32_(31)                                         /* (US_CSR) LIN Header Timeout Error Position */
#define US_CSR_LIN_LINHTE_Msk                 (_UINT32_(0x1) << US_CSR_LIN_LINHTE_Pos)             /* (US_CSR) LIN Header Timeout Error Mask */
#define US_CSR_LIN_LINHTE(value)              (US_CSR_LIN_LINHTE_Msk & (_UINT32_(value) << US_CSR_LIN_LINHTE_Pos))
#define US_CSR_LIN_Msk                        _UINT32_(0xFE80E3E3)                                  /* (US_CSR_LIN) Register Mask  */

/* LON mode */
#define US_CSR_LON_RXRDY_Pos                  _UINT32_(0)                                          /* (US_CSR) Receiver Ready (cleared by reading US_RHR) Position */
#define US_CSR_LON_RXRDY_Msk                  (_UINT32_(0x1) << US_CSR_LON_RXRDY_Pos)              /* (US_CSR) Receiver Ready (cleared by reading US_RHR) Mask */
#define US_CSR_LON_RXRDY(value)               (US_CSR_LON_RXRDY_Msk & (_UINT32_(value) << US_CSR_LON_RXRDY_Pos))
#define US_CSR_LON_TXRDY_Pos                  _UINT32_(1)                                          /* (US_CSR) Transmitter Ready (cleared by writing US_THR) Position */
#define US_CSR_LON_TXRDY_Msk                  (_UINT32_(0x1) << US_CSR_LON_TXRDY_Pos)              /* (US_CSR) Transmitter Ready (cleared by writing US_THR) Mask */
#define US_CSR_LON_TXRDY(value)               (US_CSR_LON_TXRDY_Msk & (_UINT32_(value) << US_CSR_LON_TXRDY_Pos))
#define US_CSR_LON_OVRE_Pos                   _UINT32_(5)                                          /* (US_CSR) Overrun Error (cleared by writing a one to bit US_CR.RSTSTA) Position */
#define US_CSR_LON_OVRE_Msk                   (_UINT32_(0x1) << US_CSR_LON_OVRE_Pos)               /* (US_CSR) Overrun Error (cleared by writing a one to bit US_CR.RSTSTA) Mask */
#define US_CSR_LON_OVRE(value)                (US_CSR_LON_OVRE_Msk & (_UINT32_(value) << US_CSR_LON_OVRE_Pos))
#define US_CSR_LON_LSFE_Pos                   _UINT32_(6)                                          /* (US_CSR) LON Short Frame Error Position */
#define US_CSR_LON_LSFE_Msk                   (_UINT32_(0x1) << US_CSR_LON_LSFE_Pos)               /* (US_CSR) LON Short Frame Error Mask */
#define US_CSR_LON_LSFE(value)                (US_CSR_LON_LSFE_Msk & (_UINT32_(value) << US_CSR_LON_LSFE_Pos))
#define US_CSR_LON_LCRCE_Pos                  _UINT32_(7)                                          /* (US_CSR) LON CRC Error Position */
#define US_CSR_LON_LCRCE_Msk                  (_UINT32_(0x1) << US_CSR_LON_LCRCE_Pos)              /* (US_CSR) LON CRC Error Mask */
#define US_CSR_LON_LCRCE(value)               (US_CSR_LON_LCRCE_Msk & (_UINT32_(value) << US_CSR_LON_LCRCE_Pos))
#define US_CSR_LON_TXEMPTY_Pos                _UINT32_(9)                                          /* (US_CSR) Transmitter Empty (cleared by writing US_THR) Position */
#define US_CSR_LON_TXEMPTY_Msk                (_UINT32_(0x1) << US_CSR_LON_TXEMPTY_Pos)            /* (US_CSR) Transmitter Empty (cleared by writing US_THR) Mask */
#define US_CSR_LON_TXEMPTY(value)             (US_CSR_LON_TXEMPTY_Msk & (_UINT32_(value) << US_CSR_LON_TXEMPTY_Pos))
#define US_CSR_LON_UNRE_Pos                   _UINT32_(10)                                         /* (US_CSR) Underrun Error Position */
#define US_CSR_LON_UNRE_Msk                   (_UINT32_(0x1) << US_CSR_LON_UNRE_Pos)               /* (US_CSR) Underrun Error Mask */
#define US_CSR_LON_UNRE(value)                (US_CSR_LON_UNRE_Msk & (_UINT32_(value) << US_CSR_LON_UNRE_Pos))
#define US_CSR_LON_LTXD_Pos                   _UINT32_(24)                                         /* (US_CSR) LON Transmission End Flag Position */
#define US_CSR_LON_LTXD_Msk                   (_UINT32_(0x1) << US_CSR_LON_LTXD_Pos)               /* (US_CSR) LON Transmission End Flag Mask */
#define US_CSR_LON_LTXD(value)                (US_CSR_LON_LTXD_Msk & (_UINT32_(value) << US_CSR_LON_LTXD_Pos))
#define US_CSR_LON_LCOL_Pos                   _UINT32_(25)                                         /* (US_CSR) LON Collision Detected Flag Position */
#define US_CSR_LON_LCOL_Msk                   (_UINT32_(0x1) << US_CSR_LON_LCOL_Pos)               /* (US_CSR) LON Collision Detected Flag Mask */
#define US_CSR_LON_LCOL(value)                (US_CSR_LON_LCOL_Msk & (_UINT32_(value) << US_CSR_LON_LCOL_Pos))
#define US_CSR_LON_LFET_Pos                   _UINT32_(26)                                         /* (US_CSR) LON Frame Early Termination Position */
#define US_CSR_LON_LFET_Msk                   (_UINT32_(0x1) << US_CSR_LON_LFET_Pos)               /* (US_CSR) LON Frame Early Termination Mask */
#define US_CSR_LON_LFET(value)                (US_CSR_LON_LFET_Msk & (_UINT32_(value) << US_CSR_LON_LFET_Pos))
#define US_CSR_LON_LRXD_Pos                   _UINT32_(27)                                         /* (US_CSR) LON Reception End Flag Position */
#define US_CSR_LON_LRXD_Msk                   (_UINT32_(0x1) << US_CSR_LON_LRXD_Pos)               /* (US_CSR) LON Reception End Flag Mask */
#define US_CSR_LON_LRXD(value)                (US_CSR_LON_LRXD_Msk & (_UINT32_(value) << US_CSR_LON_LRXD_Pos))
#define US_CSR_LON_LBLOVFE_Pos                _UINT32_(28)                                         /* (US_CSR) LON Backlog Overflow Error Position */
#define US_CSR_LON_LBLOVFE_Msk                (_UINT32_(0x1) << US_CSR_LON_LBLOVFE_Pos)            /* (US_CSR) LON Backlog Overflow Error Mask */
#define US_CSR_LON_LBLOVFE(value)             (US_CSR_LON_LBLOVFE_Msk & (_UINT32_(value) << US_CSR_LON_LBLOVFE_Pos))
#define US_CSR_LON_Msk                        _UINT32_(0x1F0006E3)                                  /* (US_CSR_LON) Register Mask  */


