Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/usart.h
/* -------- US_NER : (USART Offset: 0x44) ( R/ 32) Number of Errors Register -------- */
#define US_NER_NB_ERRORS_Pos                  _UINT32_(0)                                          /* (US_NER) Number of Errors Position */
#define US_NER_NB_ERRORS_Msk                  (_UINT32_(0xFF) << US_NER_NB_ERRORS_Pos)             /* (US_NER) Number of Errors Mask */
#define US_NER_NB_ERRORS(value)               (US_NER_NB_ERRORS_Msk & (_UINT32_(value) << US_NER_NB_ERRORS_Pos)) /* Assigment of value for NB_ERRORS in the US_NER register */
#define US_NER_Msk                            _UINT32_(0x000000FF)                                 /* (US_NER) Register Mask  */


/* -------- US_IF : (USART Offset: 0x4C) (R/W 32) IrDA Filter Register -------- */
#define US_IF_IRDA_FILTER_Pos                 _UINT32_(0)                                          /* (US_IF) IrDA Filter Position */
#define US_IF_IRDA_FILTER_Msk                 (_UINT32_(0xFF) << US_IF_IRDA_FILTER_Pos)            /* (US_IF) IrDA Filter Mask */
#define US_IF_IRDA_FILTER(value)              (US_IF_IRDA_FILTER_Msk & (_UINT32_(value) << US_IF_IRDA_FILTER_Pos)) /* Assigment of value for IRDA_FILTER in the US_IF register */
#define US_IF_Msk                             _UINT32_(0x000000FF)                                 /* (US_IF) Register Mask  */


/* -------- US_MAN : (USART Offset: 0x50) (R/W 32) Manchester Configuration Register -------- */
#define US_MAN_TX_PL_Pos                      _UINT32_(0)                                          /* (US_MAN) Transmitter Preamble Length Position */
#define US_MAN_TX_PL_Msk                      (_UINT32_(0xF) << US_MAN_TX_PL_Pos)                  /* (US_MAN) Transmitter Preamble Length Mask */
#define US_MAN_TX_PL(value)                   (US_MAN_TX_PL_Msk & (_UINT32_(value) << US_MAN_TX_PL_Pos)) /* Assigment of value for TX_PL in the US_MAN register */
#define US_MAN_TX_PP_Pos                      _UINT32_(8)                                          /* (US_MAN) Transmitter Preamble Pattern Position */
#define US_MAN_TX_PP_Msk                      (_UINT32_(0x3) << US_MAN_TX_PP_Pos)                  /* (US_MAN) Transmitter Preamble Pattern Mask */
#define US_MAN_TX_PP(value)                   (US_MAN_TX_PP_Msk & (_UINT32_(value) << US_MAN_TX_PP_Pos)) /* Assigment of value for TX_PP in the US_MAN register */
#define   US_MAN_TX_PP_ALL_ONE_Val            _UINT32_(0x0)                                        /* (US_MAN) The preamble is composed of '1's  */
#define   US_MAN_TX_PP_ALL_ZERO_Val           _UINT32_(0x1)                                        /* (US_MAN) The preamble is composed of '0's  */
#define   US_MAN_TX_PP_ZERO_ONE_Val           _UINT32_(0x2)                                        /* (US_MAN) The preamble is composed of '01's  */
#define   US_MAN_TX_PP_ONE_ZERO_Val           _UINT32_(0x3)                                        /* (US_MAN) The preamble is composed of '10's  */
#define US_MAN_TX_PP_ALL_ONE                  (US_MAN_TX_PP_ALL_ONE_Val << US_MAN_TX_PP_Pos)       /* (US_MAN) The preamble is composed of '1's Position  */
#define US_MAN_TX_PP_ALL_ZERO                 (US_MAN_TX_PP_ALL_ZERO_Val << US_MAN_TX_PP_Pos)      /* (US_MAN) The preamble is composed of '0's Position  */
#define US_MAN_TX_PP_ZERO_ONE                 (US_MAN_TX_PP_ZERO_ONE_Val << US_MAN_TX_PP_Pos)      /* (US_MAN) The preamble is composed of '01's Position  */
#define US_MAN_TX_PP_ONE_ZERO                 (US_MAN_TX_PP_ONE_ZERO_Val << US_MAN_TX_PP_Pos)      /* (US_MAN) The preamble is composed of '10's Position  */
#define US_MAN_TX_MPOL_Pos                    _UINT32_(12)                                         /* (US_MAN) Transmitter Manchester Polarity Position */
#define US_MAN_TX_MPOL_Msk                    (_UINT32_(0x1) << US_MAN_TX_MPOL_Pos)                /* (US_MAN) Transmitter Manchester Polarity Mask */
#define US_MAN_TX_MPOL(value)                 (US_MAN_TX_MPOL_Msk & (_UINT32_(value) << US_MAN_TX_MPOL_Pos)) /* Assigment of value for TX_MPOL in the US_MAN register */
#define US_MAN_RX_PL_Pos                      _UINT32_(16)                                         /* (US_MAN) Receiver Preamble Length Position */
#define US_MAN_RX_PL_Msk                      (_UINT32_(0xF) << US_MAN_RX_PL_Pos)                  /* (US_MAN) Receiver Preamble Length Mask */
#define US_MAN_RX_PL(value)                   (US_MAN_RX_PL_Msk & (_UINT32_(value) << US_MAN_RX_PL_Pos)) /* Assigment of value for RX_PL in the US_MAN register */
#define US_MAN_RX_PP_Pos                      _UINT32_(24)                                         /* (US_MAN) Receiver Preamble Pattern detected Position */
#define US_MAN_RX_PP_Msk                      (_UINT32_(0x3) << US_MAN_RX_PP_Pos)                  /* (US_MAN) Receiver Preamble Pattern detected Mask */
#define US_MAN_RX_PP(value)                   (US_MAN_RX_PP_Msk & (_UINT32_(value) << US_MAN_RX_PP_Pos)) /* Assigment of value for RX_PP in the US_MAN register */
#define   US_MAN_RX_PP_ALL_ONE_Val            _UINT32_(0x0)                                        /* (US_MAN) The preamble is composed of '1's  */
#define   US_MAN_RX_PP_ALL_ZERO_Val           _UINT32_(0x1)                                        /* (US_MAN) The preamble is composed of '0's  */
#define   US_MAN_RX_PP_ZERO_ONE_Val           _UINT32_(0x2)                                        /* (US_MAN) The preamble is composed of '01's  */
#define   US_MAN_RX_PP_ONE_ZERO_Val           _UINT32_(0x3)                                        /* (US_MAN) The preamble is composed of '10's  */
#define US_MAN_RX_PP_ALL_ONE                  (US_MAN_RX_PP_ALL_ONE_Val << US_MAN_RX_PP_Pos)       /* (US_MAN) The preamble is composed of '1's Position  */
#define US_MAN_RX_PP_ALL_ZERO                 (US_MAN_RX_PP_ALL_ZERO_Val << US_MAN_RX_PP_Pos)      /* (US_MAN) The preamble is composed of '0's Position  */
#define US_MAN_RX_PP_ZERO_ONE                 (US_MAN_RX_PP_ZERO_ONE_Val << US_MAN_RX_PP_Pos)      /* (US_MAN) The preamble is composed of '01's Position  */
#define US_MAN_RX_PP_ONE_ZERO                 (US_MAN_RX_PP_ONE_ZERO_Val << US_MAN_RX_PP_Pos)      /* (US_MAN) The preamble is composed of '10's Position  */
#define US_MAN_RX_MPOL_Pos                    _UINT32_(28)                                         /* (US_MAN) Receiver Manchester Polarity Position */
#define US_MAN_RX_MPOL_Msk                    (_UINT32_(0x1) << US_MAN_RX_MPOL_Pos)                /* (US_MAN) Receiver Manchester Polarity Mask */
#define US_MAN_RX_MPOL(value)                 (US_MAN_RX_MPOL_Msk & (_UINT32_(value) << US_MAN_RX_MPOL_Pos)) /* Assigment of value for RX_MPOL in the US_MAN register */
#define US_MAN_ONE_Pos                        _UINT32_(29)                                         /* (US_MAN) Must Be Set to 1 Position */
#define US_MAN_ONE_Msk                        (_UINT32_(0x1) << US_MAN_ONE_Pos)                    /* (US_MAN) Must Be Set to 1 Mask */
#define US_MAN_ONE(value)                     (US_MAN_ONE_Msk & (_UINT32_(value) << US_MAN_ONE_Pos)) /* Assigment of value for ONE in the US_MAN register */
#define US_MAN_DRIFT_Pos                      _UINT32_(30)                                         /* (US_MAN) Drift Compensation Position */
#define US_MAN_DRIFT_Msk                      (_UINT32_(0x1) << US_MAN_DRIFT_Pos)                  /* (US_MAN) Drift Compensation Mask */
#define US_MAN_DRIFT(value)                   (US_MAN_DRIFT_Msk & (_UINT32_(value) << US_MAN_DRIFT_Pos)) /* Assigment of value for DRIFT in the US_MAN register */
#define US_MAN_RXIDLEV_Pos                    _UINT32_(31)                                         /* (US_MAN) Receiver Idle Value Position */
#define US_MAN_RXIDLEV_Msk                    (_UINT32_(0x1) << US_MAN_RXIDLEV_Pos)                /* (US_MAN) Receiver Idle Value Mask */
#define US_MAN_RXIDLEV(value)                 (US_MAN_RXIDLEV_Msk & (_UINT32_(value) << US_MAN_RXIDLEV_Pos)) /* Assigment of value for RXIDLEV in the US_MAN register */
#define US_MAN_Msk                            _UINT32_(0xF30F130F)                                 /* (US_MAN) Register Mask  */


/* -------- US_LINMR : (USART Offset: 0x54) (R/W 32) LIN Mode Register -------- */
#define US_LINMR_NACT_Pos                     _UINT32_(0)                                          /* (US_LINMR) LIN Node Action Position */
#define US_LINMR_NACT_Msk                     (_UINT32_(0x3) << US_LINMR_NACT_Pos)                 /* (US_LINMR) LIN Node Action Mask */
#define US_LINMR_NACT(value)                  (US_LINMR_NACT_Msk & (_UINT32_(value) << US_LINMR_NACT_Pos)) /* Assigment of value for NACT in the US_LINMR register */
#define   US_LINMR_NACT_PUBLISH_Val           _UINT32_(0x0)                                        /* (US_LINMR) The USART transmits the response.  */
#define   US_LINMR_NACT_SUBSCRIBE_Val         _UINT32_(0x1)                                        /* (US_LINMR) The USART receives the response.  */
#define   US_LINMR_NACT_IGNORE_Val            _UINT32_(0x2)                                        /* (US_LINMR) The USART does not transmit and does not receive the response.  */
#define US_LINMR_NACT_PUBLISH                 (US_LINMR_NACT_PUBLISH_Val << US_LINMR_NACT_Pos)     /* (US_LINMR) The USART transmits the response. Position  */
#define US_LINMR_NACT_SUBSCRIBE               (US_LINMR_NACT_SUBSCRIBE_Val << US_LINMR_NACT_Pos)   /* (US_LINMR) The USART receives the response. Position  */
#define US_LINMR_NACT_IGNORE                  (US_LINMR_NACT_IGNORE_Val << US_LINMR_NACT_Pos)      /* (US_LINMR) The USART does not transmit and does not receive the response. Position  */
#define US_LINMR_PARDIS_Pos                   _UINT32_(2)                                          /* (US_LINMR) Parity Disable Position */
#define US_LINMR_PARDIS_Msk                   (_UINT32_(0x1) << US_LINMR_PARDIS_Pos)               /* (US_LINMR) Parity Disable Mask */
#define US_LINMR_PARDIS(value)                (US_LINMR_PARDIS_Msk & (_UINT32_(value) << US_LINMR_PARDIS_Pos)) /* Assigment of value for PARDIS in the US_LINMR register */
#define US_LINMR_CHKDIS_Pos                   _UINT32_(3)                                          /* (US_LINMR) Checksum Disable Position */
#define US_LINMR_CHKDIS_Msk                   (_UINT32_(0x1) << US_LINMR_CHKDIS_Pos)               /* (US_LINMR) Checksum Disable Mask */
#define US_LINMR_CHKDIS(value)                (US_LINMR_CHKDIS_Msk & (_UINT32_(value) << US_LINMR_CHKDIS_Pos)) /* Assigment of value for CHKDIS in the US_LINMR register */
#define US_LINMR_CHKTYP_Pos                   _UINT32_(4)                                          /* (US_LINMR) Checksum Type Position */
#define US_LINMR_CHKTYP_Msk                   (_UINT32_(0x1) << US_LINMR_CHKTYP_Pos)               /* (US_LINMR) Checksum Type Mask */
#define US_LINMR_CHKTYP(value)                (US_LINMR_CHKTYP_Msk & (_UINT32_(value) << US_LINMR_CHKTYP_Pos)) /* Assigment of value for CHKTYP in the US_LINMR register */
#define US_LINMR_DLM_Pos                      _UINT32_(5)                                          /* (US_LINMR) Data Length Mode Position */
#define US_LINMR_DLM_Msk                      (_UINT32_(0x1) << US_LINMR_DLM_Pos)                  /* (US_LINMR) Data Length Mode Mask */
#define US_LINMR_DLM(value)                   (US_LINMR_DLM_Msk & (_UINT32_(value) << US_LINMR_DLM_Pos)) /* Assigment of value for DLM in the US_LINMR register */
#define US_LINMR_FSDIS_Pos                    _UINT32_(6)                                          /* (US_LINMR) Frame Slot Mode Disable Position */
#define US_LINMR_FSDIS_Msk                    (_UINT32_(0x1) << US_LINMR_FSDIS_Pos)                /* (US_LINMR) Frame Slot Mode Disable Mask */
#define US_LINMR_FSDIS(value)                 (US_LINMR_FSDIS_Msk & (_UINT32_(value) << US_LINMR_FSDIS_Pos)) /* Assigment of value for FSDIS in the US_LINMR register */
#define US_LINMR_WKUPTYP_Pos                  _UINT32_(7)                                          /* (US_LINMR) Wakeup Signal Type Position */
#define US_LINMR_WKUPTYP_Msk                  (_UINT32_(0x1) << US_LINMR_WKUPTYP_Pos)              /* (US_LINMR) Wakeup Signal Type Mask */
#define US_LINMR_WKUPTYP(value)               (US_LINMR_WKUPTYP_Msk & (_UINT32_(value) << US_LINMR_WKUPTYP_Pos)) /* Assigment of value for WKUPTYP in the US_LINMR register */
#define US_LINMR_DLC_Pos                      _UINT32_(8)                                          /* (US_LINMR) Data Length Control Position */
#define US_LINMR_DLC_Msk                      (_UINT32_(0xFF) << US_LINMR_DLC_Pos)                 /* (US_LINMR) Data Length Control Mask */
#define US_LINMR_DLC(value)                   (US_LINMR_DLC_Msk & (_UINT32_(value) << US_LINMR_DLC_Pos)) /* Assigment of value for DLC in the US_LINMR register */
#define US_LINMR_PDCM_Pos                     _UINT32_(16)                                         /* (US_LINMR) DMAC Mode Position */
#define US_LINMR_PDCM_Msk                     (_UINT32_(0x1) << US_LINMR_PDCM_Pos)                 /* (US_LINMR) DMAC Mode Mask */
#define US_LINMR_PDCM(value)                  (US_LINMR_PDCM_Msk & (_UINT32_(value) << US_LINMR_PDCM_Pos)) /* Assigment of value for PDCM in the US_LINMR register */
#define US_LINMR_SYNCDIS_Pos                  _UINT32_(17)                                         /* (US_LINMR) Synchronization Disable Position */
#define US_LINMR_SYNCDIS_Msk                  (_UINT32_(0x1) << US_LINMR_SYNCDIS_Pos)              /* (US_LINMR) Synchronization Disable Mask */
#define US_LINMR_SYNCDIS(value)               (US_LINMR_SYNCDIS_Msk & (_UINT32_(value) << US_LINMR_SYNCDIS_Pos)) /* Assigment of value for SYNCDIS in the US_LINMR register */
#define US_LINMR_Msk                          _UINT32_(0x0003FFFF)                                 /* (US_LINMR) Register Mask  */


/* -------- US_LINIR : (USART Offset: 0x58) (R/W 32) LIN Identifier Register -------- */
#define US_LINIR_IDCHR_Pos                    _UINT32_(0)                                          /* (US_LINIR) Identifier Character Position */
#define US_LINIR_IDCHR_Msk                    (_UINT32_(0xFF) << US_LINIR_IDCHR_Pos)               /* (US_LINIR) Identifier Character Mask */
#define US_LINIR_IDCHR(value)                 (US_LINIR_IDCHR_Msk & (_UINT32_(value) << US_LINIR_IDCHR_Pos)) /* Assigment of value for IDCHR in the US_LINIR register */
#define US_LINIR_Msk                          _UINT32_(0x000000FF)                                 /* (US_LINIR) Register Mask  */


