Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/usart.h
/* -------- US_LINBRR : (USART Offset: 0x5C) ( R/ 32) LIN Baud Rate Register -------- */
#define US_LINBRR_LINCD_Pos                   _UINT32_(0)                                          /* (US_LINBRR) Clock Divider after Synchronization Position */
#define US_LINBRR_LINCD_Msk                   (_UINT32_(0xFFFF) << US_LINBRR_LINCD_Pos)            /* (US_LINBRR) Clock Divider after Synchronization Mask */
#define US_LINBRR_LINCD(value)                (US_LINBRR_LINCD_Msk & (_UINT32_(value) << US_LINBRR_LINCD_Pos)) /* Assigment of value for LINCD in the US_LINBRR register */
#define US_LINBRR_LINFP_Pos                   _UINT32_(16)                                         /* (US_LINBRR) Fractional Part after Synchronization Position */
#define US_LINBRR_LINFP_Msk                   (_UINT32_(0x7) << US_LINBRR_LINFP_Pos)               /* (US_LINBRR) Fractional Part after Synchronization Mask */
#define US_LINBRR_LINFP(value)                (US_LINBRR_LINFP_Msk & (_UINT32_(value) << US_LINBRR_LINFP_Pos)) /* Assigment of value for LINFP in the US_LINBRR register */
#define US_LINBRR_Msk                         _UINT32_(0x0007FFFF)                                 /* (US_LINBRR) Register Mask  */


/* -------- US_LONMR : (USART Offset: 0x60) (R/W 32) LON Mode Register -------- */
#define US_LONMR_COMMT_Pos                    _UINT32_(0)                                          /* (US_LONMR) LON comm_type Parameter Value Position */
#define US_LONMR_COMMT_Msk                    (_UINT32_(0x1) << US_LONMR_COMMT_Pos)                /* (US_LONMR) LON comm_type Parameter Value Mask */
#define US_LONMR_COMMT(value)                 (US_LONMR_COMMT_Msk & (_UINT32_(value) << US_LONMR_COMMT_Pos)) /* Assigment of value for COMMT in the US_LONMR register */
#define US_LONMR_COLDET_Pos                   _UINT32_(1)                                          /* (US_LONMR) LON Collision Detection Feature Position */
#define US_LONMR_COLDET_Msk                   (_UINT32_(0x1) << US_LONMR_COLDET_Pos)               /* (US_LONMR) LON Collision Detection Feature Mask */
#define US_LONMR_COLDET(value)                (US_LONMR_COLDET_Msk & (_UINT32_(value) << US_LONMR_COLDET_Pos)) /* Assigment of value for COLDET in the US_LONMR register */
#define US_LONMR_TCOL_Pos                     _UINT32_(2)                                          /* (US_LONMR) Terminate Frame upon Collision Notification Position */
#define US_LONMR_TCOL_Msk                     (_UINT32_(0x1) << US_LONMR_TCOL_Pos)                 /* (US_LONMR) Terminate Frame upon Collision Notification Mask */
#define US_LONMR_TCOL(value)                  (US_LONMR_TCOL_Msk & (_UINT32_(value) << US_LONMR_TCOL_Pos)) /* Assigment of value for TCOL in the US_LONMR register */
#define US_LONMR_CDTAIL_Pos                   _UINT32_(3)                                          /* (US_LONMR) LON Collision Detection on Frame Tail Position */
#define US_LONMR_CDTAIL_Msk                   (_UINT32_(0x1) << US_LONMR_CDTAIL_Pos)               /* (US_LONMR) LON Collision Detection on Frame Tail Mask */
#define US_LONMR_CDTAIL(value)                (US_LONMR_CDTAIL_Msk & (_UINT32_(value) << US_LONMR_CDTAIL_Pos)) /* Assigment of value for CDTAIL in the US_LONMR register */
#define US_LONMR_DMAM_Pos                     _UINT32_(4)                                          /* (US_LONMR) LON DMA Mode Position */
#define US_LONMR_DMAM_Msk                     (_UINT32_(0x1) << US_LONMR_DMAM_Pos)                 /* (US_LONMR) LON DMA Mode Mask */
#define US_LONMR_DMAM(value)                  (US_LONMR_DMAM_Msk & (_UINT32_(value) << US_LONMR_DMAM_Pos)) /* Assigment of value for DMAM in the US_LONMR register */
#define US_LONMR_LCDS_Pos                     _UINT32_(5)                                          /* (US_LONMR) LON Collision Detection Source Position */
#define US_LONMR_LCDS_Msk                     (_UINT32_(0x1) << US_LONMR_LCDS_Pos)                 /* (US_LONMR) LON Collision Detection Source Mask */
#define US_LONMR_LCDS(value)                  (US_LONMR_LCDS_Msk & (_UINT32_(value) << US_LONMR_LCDS_Pos)) /* Assigment of value for LCDS in the US_LONMR register */
#define US_LONMR_EOFS_Pos                     _UINT32_(16)                                         /* (US_LONMR) End of Frame Condition Size Position */
#define US_LONMR_EOFS_Msk                     (_UINT32_(0xFF) << US_LONMR_EOFS_Pos)                /* (US_LONMR) End of Frame Condition Size Mask */
#define US_LONMR_EOFS(value)                  (US_LONMR_EOFS_Msk & (_UINT32_(value) << US_LONMR_EOFS_Pos)) /* Assigment of value for EOFS in the US_LONMR register */
#define US_LONMR_Msk                          _UINT32_(0x00FF003F)                                 /* (US_LONMR) Register Mask  */


/* -------- US_LONPR : (USART Offset: 0x64) (R/W 32) LON Preamble Register -------- */
#define US_LONPR_LONPL_Pos                    _UINT32_(0)                                          /* (US_LONPR) LON Preamble Length Position */
#define US_LONPR_LONPL_Msk                    (_UINT32_(0x3FFF) << US_LONPR_LONPL_Pos)             /* (US_LONPR) LON Preamble Length Mask */
#define US_LONPR_LONPL(value)                 (US_LONPR_LONPL_Msk & (_UINT32_(value) << US_LONPR_LONPL_Pos)) /* Assigment of value for LONPL in the US_LONPR register */
#define US_LONPR_Msk                          _UINT32_(0x00003FFF)                                 /* (US_LONPR) Register Mask  */


/* -------- US_LONDL : (USART Offset: 0x68) (R/W 32) LON Data Length Register -------- */
#define US_LONDL_LONDL_Pos                    _UINT32_(0)                                          /* (US_LONDL) LON Data Length Position */
#define US_LONDL_LONDL_Msk                    (_UINT32_(0xFF) << US_LONDL_LONDL_Pos)               /* (US_LONDL) LON Data Length Mask */
#define US_LONDL_LONDL(value)                 (US_LONDL_LONDL_Msk & (_UINT32_(value) << US_LONDL_LONDL_Pos)) /* Assigment of value for LONDL in the US_LONDL register */
#define US_LONDL_Msk                          _UINT32_(0x000000FF)                                 /* (US_LONDL) Register Mask  */


