Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/usart.h
/* -------- US_LONL2HDR : (USART Offset: 0x6C) (R/W 32) LON L2HDR Register -------- */
#define US_LONL2HDR_BLI_Pos                   _UINT32_(0)                                          /* (US_LONL2HDR) LON Backlog Increment Position */
#define US_LONL2HDR_BLI_Msk                   (_UINT32_(0x3F) << US_LONL2HDR_BLI_Pos)              /* (US_LONL2HDR) LON Backlog Increment Mask */
#define US_LONL2HDR_BLI(value)                (US_LONL2HDR_BLI_Msk & (_UINT32_(value) << US_LONL2HDR_BLI_Pos)) /* Assigment of value for BLI in the US_LONL2HDR register */
#define US_LONL2HDR_ALTP_Pos                  _UINT32_(6)                                          /* (US_LONL2HDR) LON Alternate Path Bit Position */
#define US_LONL2HDR_ALTP_Msk                  (_UINT32_(0x1) << US_LONL2HDR_ALTP_Pos)              /* (US_LONL2HDR) LON Alternate Path Bit Mask */
#define US_LONL2HDR_ALTP(value)               (US_LONL2HDR_ALTP_Msk & (_UINT32_(value) << US_LONL2HDR_ALTP_Pos)) /* Assigment of value for ALTP in the US_LONL2HDR register */
#define US_LONL2HDR_PB_Pos                    _UINT32_(7)                                          /* (US_LONL2HDR) LON Priority Bit Position */
#define US_LONL2HDR_PB_Msk                    (_UINT32_(0x1) << US_LONL2HDR_PB_Pos)                /* (US_LONL2HDR) LON Priority Bit Mask */
#define US_LONL2HDR_PB(value)                 (US_LONL2HDR_PB_Msk & (_UINT32_(value) << US_LONL2HDR_PB_Pos)) /* Assigment of value for PB in the US_LONL2HDR register */
#define US_LONL2HDR_Msk                       _UINT32_(0x000000FF)                                 /* (US_LONL2HDR) Register Mask  */


/* -------- US_LONBL : (USART Offset: 0x70) ( R/ 32) LON Backlog Register -------- */
#define US_LONBL_LONBL_Pos                    _UINT32_(0)                                          /* (US_LONBL) LON Node Backlog Value Position */
#define US_LONBL_LONBL_Msk                    (_UINT32_(0x3F) << US_LONBL_LONBL_Pos)               /* (US_LONBL) LON Node Backlog Value Mask */
#define US_LONBL_LONBL(value)                 (US_LONBL_LONBL_Msk & (_UINT32_(value) << US_LONBL_LONBL_Pos)) /* Assigment of value for LONBL in the US_LONBL register */
#define US_LONBL_Msk                          _UINT32_(0x0000003F)                                 /* (US_LONBL) Register Mask  */


/* -------- US_LONB1TX : (USART Offset: 0x74) (R/W 32) LON Beta1 Tx Register -------- */
#define US_LONB1TX_BETA1TX_Pos                _UINT32_(0)                                          /* (US_LONB1TX) LON Beta1 Length after Transmission Position */
#define US_LONB1TX_BETA1TX_Msk                (_UINT32_(0xFFFFFF) << US_LONB1TX_BETA1TX_Pos)       /* (US_LONB1TX) LON Beta1 Length after Transmission Mask */
#define US_LONB1TX_BETA1TX(value)             (US_LONB1TX_BETA1TX_Msk & (_UINT32_(value) << US_LONB1TX_BETA1TX_Pos)) /* Assigment of value for BETA1TX in the US_LONB1TX register */
#define US_LONB1TX_Msk                        _UINT32_(0x00FFFFFF)                                 /* (US_LONB1TX) Register Mask  */


/* -------- US_LONB1RX : (USART Offset: 0x78) (R/W 32) LON Beta1 Rx Register -------- */
#define US_LONB1RX_BETA1RX_Pos                _UINT32_(0)                                          /* (US_LONB1RX) LON Beta1 Length after Reception Position */
#define US_LONB1RX_BETA1RX_Msk                (_UINT32_(0xFFFFFF) << US_LONB1RX_BETA1RX_Pos)       /* (US_LONB1RX) LON Beta1 Length after Reception Mask */
#define US_LONB1RX_BETA1RX(value)             (US_LONB1RX_BETA1RX_Msk & (_UINT32_(value) << US_LONB1RX_BETA1RX_Pos)) /* Assigment of value for BETA1RX in the US_LONB1RX register */
#define US_LONB1RX_Msk                        _UINT32_(0x00FFFFFF)                                 /* (US_LONB1RX) Register Mask  */


/* -------- US_LONPRIO : (USART Offset: 0x7C) (R/W 32) LON Priority Register -------- */
#define US_LONPRIO_PSNB_Pos                   _UINT32_(0)                                          /* (US_LONPRIO) LON Priority Slot Number Position */
#define US_LONPRIO_PSNB_Msk                   (_UINT32_(0x7F) << US_LONPRIO_PSNB_Pos)              /* (US_LONPRIO) LON Priority Slot Number Mask */
#define US_LONPRIO_PSNB(value)                (US_LONPRIO_PSNB_Msk & (_UINT32_(value) << US_LONPRIO_PSNB_Pos)) /* Assigment of value for PSNB in the US_LONPRIO register */
#define US_LONPRIO_NPS_Pos                    _UINT32_(8)                                          /* (US_LONPRIO) LON Node Priority Slot Position */
#define US_LONPRIO_NPS_Msk                    (_UINT32_(0x7F) << US_LONPRIO_NPS_Pos)               /* (US_LONPRIO) LON Node Priority Slot Mask */
#define US_LONPRIO_NPS(value)                 (US_LONPRIO_NPS_Msk & (_UINT32_(value) << US_LONPRIO_NPS_Pos)) /* Assigment of value for NPS in the US_LONPRIO register */
#define US_LONPRIO_Msk                        _UINT32_(0x00007F7F)                                 /* (US_LONPRIO) Register Mask  */


/* -------- US_IDTTX : (USART Offset: 0x80) (R/W 32) LON IDT Tx Register -------- */
#define US_IDTTX_IDTTX_Pos                    _UINT32_(0)                                          /* (US_IDTTX) LON Indeterminate Time after Transmission (comm_type = 1 mode only) Position */
#define US_IDTTX_IDTTX_Msk                    (_UINT32_(0xFFFFFF) << US_IDTTX_IDTTX_Pos)           /* (US_IDTTX) LON Indeterminate Time after Transmission (comm_type = 1 mode only) Mask */
#define US_IDTTX_IDTTX(value)                 (US_IDTTX_IDTTX_Msk & (_UINT32_(value) << US_IDTTX_IDTTX_Pos)) /* Assigment of value for IDTTX in the US_IDTTX register */
#define US_IDTTX_Msk                          _UINT32_(0x00FFFFFF)                                 /* (US_IDTTX) Register Mask  */


/* -------- US_IDTRX : (USART Offset: 0x84) (R/W 32) LON IDT Rx Register -------- */
#define US_IDTRX_IDTRX_Pos                    _UINT32_(0)                                          /* (US_IDTRX) LON Indeterminate Time after Reception (comm_type = 1 mode only) Position */
#define US_IDTRX_IDTRX_Msk                    (_UINT32_(0xFFFFFF) << US_IDTRX_IDTRX_Pos)           /* (US_IDTRX) LON Indeterminate Time after Reception (comm_type = 1 mode only) Mask */
#define US_IDTRX_IDTRX(value)                 (US_IDTRX_IDTRX_Msk & (_UINT32_(value) << US_IDTRX_IDTRX_Pos)) /* Assigment of value for IDTRX in the US_IDTRX register */
#define US_IDTRX_Msk                          _UINT32_(0x00FFFFFF)                                 /* (US_IDTRX) Register Mask  */


/* -------- US_ICDIFF : (USART Offset: 0x88) (R/W 32) IC DIFF Register -------- */
#define US_ICDIFF_ICDIFF_Pos                  _UINT32_(0)                                          /* (US_ICDIFF) IC Differentiator Number Position */
#define US_ICDIFF_ICDIFF_Msk                  (_UINT32_(0xF) << US_ICDIFF_ICDIFF_Pos)              /* (US_ICDIFF) IC Differentiator Number Mask */
#define US_ICDIFF_ICDIFF(value)               (US_ICDIFF_ICDIFF_Msk & (_UINT32_(value) << US_ICDIFF_ICDIFF_Pos)) /* Assigment of value for ICDIFF in the US_ICDIFF register */
#define US_ICDIFF_Msk                         _UINT32_(0x0000000F)                                 /* (US_ICDIFF) Register Mask  */


/* -------- US_WPMR : (USART Offset: 0xE4) (R/W 32) Write Protection Mode Register -------- */
#define US_WPMR_WPEN_Pos                      _UINT32_(0)                                          /* (US_WPMR) Write Protection Enable Position */
#define US_WPMR_WPEN_Msk                      (_UINT32_(0x1) << US_WPMR_WPEN_Pos)                  /* (US_WPMR) Write Protection Enable Mask */
#define US_WPMR_WPEN(value)                   (US_WPMR_WPEN_Msk & (_UINT32_(value) << US_WPMR_WPEN_Pos)) /* Assigment of value for WPEN in the US_WPMR register */
#define US_WPMR_WPKEY_Pos                     _UINT32_(8)                                          /* (US_WPMR) Write Protection Key Position */
#define US_WPMR_WPKEY_Msk                     (_UINT32_(0xFFFFFF) << US_WPMR_WPKEY_Pos)            /* (US_WPMR) Write Protection Key Mask */
#define US_WPMR_WPKEY(value)                  (US_WPMR_WPKEY_Msk & (_UINT32_(value) << US_WPMR_WPKEY_Pos)) /* Assigment of value for WPKEY in the US_WPMR register */
#define   US_WPMR_WPKEY_PASSWD_Val            _UINT32_(0x555341)                                   /* (US_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0.  */
#define US_WPMR_WPKEY_PASSWD                  (US_WPMR_WPKEY_PASSWD_Val << US_WPMR_WPKEY_Pos)      /* (US_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0. Position  */
#define US_WPMR_Msk                           _UINT32_(0xFFFFFF01)                                 /* (US_WPMR) Register Mask  */


/* -------- US_WPSR : (USART Offset: 0xE8) ( R/ 32) Write Protection Status Register -------- */
#define US_WPSR_WPVS_Pos                      _UINT32_(0)                                          /* (US_WPSR) Write Protection Violation Status Position */
#define US_WPSR_WPVS_Msk                      (_UINT32_(0x1) << US_WPSR_WPVS_Pos)                  /* (US_WPSR) Write Protection Violation Status Mask */
#define US_WPSR_WPVS(value)                   (US_WPSR_WPVS_Msk & (_UINT32_(value) << US_WPSR_WPVS_Pos)) /* Assigment of value for WPVS in the US_WPSR register */
#define US_WPSR_WPVSRC_Pos                    _UINT32_(8)                                          /* (US_WPSR) Write Protection Violation Source Position */
#define US_WPSR_WPVSRC_Msk                    (_UINT32_(0xFFFF) << US_WPSR_WPVSRC_Pos)             /* (US_WPSR) Write Protection Violation Source Mask */
#define US_WPSR_WPVSRC(value)                 (US_WPSR_WPVSRC_Msk & (_UINT32_(value) << US_WPSR_WPVSRC_Pos)) /* Assigment of value for WPVSRC in the US_WPSR register */
#define US_WPSR_Msk                           _UINT32_(0x00FFFF01)                                 /* (US_WPSR) Register Mask  */


/** \brief USART register offsets definitions */
#define US_CR_REG_OFST                 _UINT32_(0x00)      /* (US_CR) Control Register Offset */
#define US_MR_REG_OFST                 _UINT32_(0x04)      /* (US_MR) Mode Register Offset */
#define US_IER_REG_OFST                _UINT32_(0x08)      /* (US_IER) Interrupt Enable Register Offset */
#define US_IDR_REG_OFST                _UINT32_(0x0C)      /* (US_IDR) Interrupt Disable Register Offset */
#define US_IMR_REG_OFST                _UINT32_(0x10)      /* (US_IMR) Interrupt Mask Register Offset */
#define US_CSR_REG_OFST                _UINT32_(0x14)      /* (US_CSR) Channel Status Register Offset */
#define US_RHR_REG_OFST                _UINT32_(0x18)      /* (US_RHR) Receive Holding Register Offset */
#define US_THR_REG_OFST                _UINT32_(0x1C)      /* (US_THR) Transmit Holding Register Offset */
#define US_BRGR_REG_OFST               _UINT32_(0x20)      /* (US_BRGR) Baud Rate Generator Register Offset */
#define US_RTOR_REG_OFST               _UINT32_(0x24)      /* (US_RTOR) Receiver Timeout Register Offset */
#define US_TTGR_REG_OFST               _UINT32_(0x28)      /* (US_TTGR) Transmitter Timeguard Register Offset */
#define US_FIDI_REG_OFST               _UINT32_(0x40)      /* (US_FIDI) FI DI Ratio Register Offset */
#define US_NER_REG_OFST                _UINT32_(0x44)      /* (US_NER) Number of Errors Register Offset */
#define US_IF_REG_OFST                 _UINT32_(0x4C)      /* (US_IF) IrDA Filter Register Offset */
#define US_MAN_REG_OFST                _UINT32_(0x50)      /* (US_MAN) Manchester Configuration Register Offset */
#define US_LINMR_REG_OFST              _UINT32_(0x54)      /* (US_LINMR) LIN Mode Register Offset */
#define US_LINIR_REG_OFST              _UINT32_(0x58)      /* (US_LINIR) LIN Identifier Register Offset */
#define US_LINBRR_REG_OFST             _UINT32_(0x5C)      /* (US_LINBRR) LIN Baud Rate Register Offset */
#define US_LONMR_REG_OFST              _UINT32_(0x60)      /* (US_LONMR) LON Mode Register Offset */
#define US_LONPR_REG_OFST              _UINT32_(0x64)      /* (US_LONPR) LON Preamble Register Offset */
#define US_LONDL_REG_OFST              _UINT32_(0x68)      /* (US_LONDL) LON Data Length Register Offset */
#define US_LONL2HDR_REG_OFST           _UINT32_(0x6C)      /* (US_LONL2HDR) LON L2HDR Register Offset */
#define US_LONBL_REG_OFST              _UINT32_(0x70)      /* (US_LONBL) LON Backlog Register Offset */
#define US_LONB1TX_REG_OFST            _UINT32_(0x74)      /* (US_LONB1TX) LON Beta1 Tx Register Offset */
#define US_LONB1RX_REG_OFST            _UINT32_(0x78)      /* (US_LONB1RX) LON Beta1 Rx Register Offset */
#define US_LONPRIO_REG_OFST            _UINT32_(0x7C)      /* (US_LONPRIO) LON Priority Register Offset */
#define US_IDTTX_REG_OFST              _UINT32_(0x80)      /* (US_IDTTX) LON IDT Tx Register Offset */
#define US_IDTRX_REG_OFST              _UINT32_(0x84)      /* (US_IDTRX) LON IDT Rx Register Offset */
#define US_ICDIFF_REG_OFST             _UINT32_(0x88)      /* (US_ICDIFF) IC DIFF Register Offset */
#define US_WPMR_REG_OFST               _UINT32_(0xE4)      /* (US_WPMR) Write Protection Mode Register Offset */
#define US_WPSR_REG_OFST               _UINT32_(0xE8)      /* (US_WPSR) Write Protection Status Register Offset */

